Revit 2024 API
FabricationDimensionDefinition Members
The FabricationDimensionDefinition type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FabricationDimensionDefinition
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsModifiable
 If the fabrication dimension is modifiable by user.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 Fabrication dimension name.
Type
 Fabrication dimension type.
UnitType
 Fabrication dimension unit type.
See Also
FabricationDimensionDefinition Class
Autodesk.Revit.DB Namespace